Revit 2027 API
IControllableDropHandler.CanExecute Method
 Implement this method to inform Revit whether the drop event can be executed onto the given view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool CanExecute(
	UIDocument document,
	Object data,
	ElementId dropViewId
)
Function CanExecute (
	document As UIDocument,
	data As Object,
	dropViewId As ElementId
) As Boolean
bool CanExecute(
	UIDocument^ document,
	Object^ data,
	ElementId^ dropViewId
)
abstract CanExecute :
        document : UIDocument *
        data : Object *
        dropViewId : ElementId -> bool
Parameters
document UIDocument
The document on which the data was dropped.
data Object
The data.
dropViewId ElementId
The view upon which the user will drop.
Return Value
Boolean
 Return true to activate the target view and execute the drop. Return false to cancel the activation and the drop execution.
Remarks
 Document modifications are not permitted from this callback.
See Also
Reference
IControllableDropHandler Interface
Autodesk.Revit.UI Namespace